_posts/2017-09-25-augmented-reality.html
---
layout: post
title: Augmented reality
excerpt: A quick recap of where AR is at
---

<p>
I just went to an <a href="https://www.meetup.com/ARSFBA/events/236282556/">augmented reality meetup</a> at the <a href="https://www.google.com/maps?f=q&hl=en&q=301+Howard+Street,+San+Francisco,+CA,+94105,+US">Google Launchpad</a> with <a href="https://www.collinchu.com/">a friend</a>. A quick recap of the topics discussed and my own thoughts:
</p>

<ul class="org-ul">
<li>Sivan Iram of <a href="https://lumusvision.com/">Lumus</a> presented on waveguide technology for AR optics
<ul class="org-ul">
<li>Newest product is a dev kit (costing around $3,500 IIRC), which is a pair of glasses that can project 3D images
</li>
</ul>
</li>
<li>Carter Agar of Lenovo presented on a headset-smartphone-controller combo that allows Jedi lightsaber duels in AR. Costs ~$200 and expected to come out December 2017 to tie in with the next Star Wars movie.
<ul class="org-ul">
<li>Based on success, will consider creating 2nd gen
</li>
<li>High cost of device expected to be offset by strength of Star Wars brand
</li>
</ul>
</li>
<li>Edward Tang of <a href="https://www.avegant.com/">Avegant</a> joined in a panel discussion on the state of AR and the biggest challenges.
<ul class="org-ul">
<li>The biggest challenge in his view? Optics, of course, which is what Avegant tackles with lightfield technology.
</li>
</ul>
</li>
<li>Stefano Baldassi of <a href="http://www.metavision.com/">Meta</a> demonstrated an AR headset that allows the user to:
<ul class="org-ul">
<li>Drag items (e.g. a model of the human body) off a virtual shelf, enlarge it, rotate it, pull pieces apart, etc.
</li>
</ul>
</li>
</ul>

<p>
A few areas in which panelists were in agreement:
</p>

<ul class="org-ul">
<li>Big tech companies will ship dedicated consumer AR devices by 2020
<ul class="org-ul">
<li>Apple recently announced <a href="https://developer.apple.com/arkit/">ARKit</a> for iOS 11
</li>
<li>Facebook, Amazon, etc. have announced intentions to pursue AR
</li>
</ul>
</li>
<li>AR market from now until 2020, and likely beyond, will be mobile devices
<ul class="org-ul">
<li>Headsets don't and won't have sufficient consumer adoption; this problem is currently seen in VR as well
</li>
</ul>
</li>
<li>We've yet to discover good AR / VR UIs
<ul class="org-ul">
<li>In early days, mobile UIs were slightly adapted desktop / laptop UIs. Similary, VR / AR UIs are basically mobile UIs right now.
</li>
</ul>
</li>
<li>Within 10-15 years, AR headsets may replace smartphones as <i>primary</i> devices.
<ul class="org-ul">
<li>Just as PCs continues to exist, smartphones will continue to exist, but be relegated to <i>secondary</i> devices
</li>
</ul>
</li>
</ul>

<p>
A few thoughts / questions of my own:
</p>

<ul class="org-ul">
<li>If major companies won't deliver flagship AR devices until 2020, there won't be a major hardware platform like the Oculus Rift or HTC Vive for VR for quite some time.
</li>
<li>How good is mobile AR?
<ul class="org-ul">
<li>Is it a means to get consumers interested in dedicated AR headsets?
</li>
<li>Can it deliver experiences that make people excited about AR?
</li>
</ul>
</li>
<li>If AR platforms remain fragmented for several years, how can fusing many sources of data together, which I see as the greatest potential of AR, be achieved?
</li>
</ul>
